{"status": "ok", "totalResults": 19523, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Mike Butcher", "title": "Social care startup Lifted raises £1.5M for end-to-end elderly care platform", "description": "The number of elderly adults requiring home care is set to grow at an alarming rate in most western countries as people live progressively longer. But underinvestment in technology and healthcare means society is at risk of vastly under-delivering. It’s very …", "url": "http://techcrunch.com/2019/09/25/social-care-startup-lifted-raises-1-5m-for-end-to-end-elderly-care-platform/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/09/Rachael-Crook-Lifted.jpg?w=563", "publishedAt": "2019-09-25T12:01:04Z", "content": "The number of elderly adults requiring home care is set to grow at an alarming rate in most western countries as people live progressively longer. But underinvestment in technology and healthcare means society is at risk of vastly under-delivering. Its very h… [+2805 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "GoodRx is coming for subscription prescription services with the launch of GoodRx Care", "description": "Several months after discreetly acquiring the online prescription service HeyDoctor, GoodRx is launching a new service based on the acquisition, GoodRx Care and offering a direct challenge to online prescription services like Hims, Hers, Nurx, Ro and others. …", "url": "http://techcrunch.com/2019/09/26/goodrx-is-coming-for-subscription-prescription-services-with-the-launch-of-goodrx-care/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2014/11/shutterstock_216498085.jpg?w=600", "publishedAt": "2019-09-26T22:48:45Z", "content": "Several months after discreetly acquiring the online prescription service HeyDoctor, GoodRx is launching a new service based on the acquisition, GoodRx Care and offering a direct challenge to online prescription services like Hims, Hers, Nurx, Ro and others.\r… [+4205 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kate Clark", "title": "Andreessen Horowitz hires Julie Yoo as general partner", "description": "Julie Yoo will make investments out of the firm's bio fund.", "url": "http://techcrunch.com/2019/10/09/andreessen-horowitz-julie-yoo-general-partner/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-598748714.jpg?w=600", "publishedAt": "2019-10-09T17:31:59Z", "content": "Julie Yoo has joined Andreessen Horowitz as its newest general partner. She will make investments out of the venture capital firm’s bio fund, which closed on $450 million in 2017.\r\nYoo spent the last eight years as a co-founder and chief product officer of Ky… [+2057 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Emma Comeau", "title": "Announcing the custom contests for the TC Hackathon at Disrupt SF", "description": "Congratulations to all the motivated hackers, coders, devs and designers who took action and secured their spot in the TechCrunch Hackathon at Disrupt San Francisco 2019 on October 2-4. We limited participation to 800 people, and we’re thrilled that the event…", "url": "http://techcrunch.com/2019/09/25/announcing-the-custom-contests-for-the-tc-hackathon-at-disrupt-sf/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2015/09/hackathon-sf-2015-midnight-06.jpg?w=614", "publishedAt": "2019-09-25T19:46:25Z", "content": "Congratulations to all the motivated hackers, coders, devs and designers who took action and secured their spot in the TechCrunch Hackathon at Disrupt San Francisco 2019 on October 2-4. We limited participation to 800 people, and were thrilled that the event … [+3612 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Hannah Harris Green", "title": "The Promise and Pitfalls of At-Home STI Tests", "description": "STIs in the United States have been on the rise in recent years, and many marginalized people who are most at risk aren’t getting tested and treated for them. But remote healthcare is also on the rise—we are moving toward a future where at-home sexual health …", "url": "https://gizmodo.com/the-promise-and-pitfalls-of-at-home-sti-tests-1839298624", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/engw8ce6ypaqu736v2pz.png", "publishedAt": "2019-10-24T16:15:00Z", "content": "STIs in the United States have been on the rise in recent years, and many marginalized people who are most at risk arent getting tested and treated for them. But remote healthcare is also on the risewe are moving toward a future where at-home sexual health sc… [+9419 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Mariella Moon", "title": "Court says Tesla and Musk's tweet violated labor laws", "description": "Tesla broke labor laws by interfering with legitimate union organizing, among other things, California administrative law judge Amita Baman Tracy has ruled. The automaker apparently committed a number of violations against the National Labor Relations Act in …", "url": "https://www.engadget.com/2019/09/28/tesla-musk-tweet-labor-law-violation/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D6000%252C4000%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1067%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-images%252F2019-07%252F6d0872c0-9d9c-11e9-9f3e-dca3b9d355c0%26client%3Da1acac3e1b3290917d92%26signature%3Da7b8d13d2d2a867b155e1aa0dc07c4029c6f6104&client=amp-blogside-v2&signature=780a14993b1cb64a9d26ad0f50f0b47d0320a57e", "publishedAt": "2019-09-28T19:02:00Z", "content": "Nothing stopping Tesla team at our car plant from voting union. Could do so tmrw if they wanted. But why pay union dues &amp; give up stock options for nothing? Our safety record is 2X better than when plant was UAW &amp; everybody already gets healthcare.\r\n—… [+799 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Opioid litigation talks can 'get a long way' to deal: lawyer", "description": "Executives from several large healthcare companies and state attorneys general can \"get a long way\" toward settling the sprawling litigation over the U.S. opioid addiction epidemic, a plaintiffs' lawyer said Friday.", "url": "https://www.reuters.com/article/us-usa-opioids-litigation-settlement-idUSKBN1WX22O", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2019-10-18T16:10:37Z", "content": "CLEVELAND (Reuters) - Executives from several large healthcare companies and state attorneys general can “get a long way” toward settling the sprawling litigation over the U.S. opioid addiction epidemic, a plaintiffs’ lawyer said Friday. \r\nPeter Weinberger sa… [+326 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Canada NDP leader says Trudeau must respect realities of minority government", "description": "The leader of Canada's left-wing New Democratic Party outlined his priority social issues including housing and healthcare on Tuesday, and said he hopes Prime Minister Justin Trudeau respects that he will need to work with other parties.", "url": "https://www.reuters.com/article/us-canada-election-ndp-idUSKBN1X123L", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443800680&w=1200&r=LYNXMPEF9L1IU", "publishedAt": "2019-10-22T16:57:06Z", "content": "BURNABY, British Columbia (Reuters) - The leader of Canada’s left-wing New Democratic Party outlined his priority social issues including housing and healthcare on Tuesday, and said he hopes Prime Minister Justin Trudeau respects that he will need to work wit… [+438 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "lramsey@businessinsider.com (Lydia Ramsey), Lydia Ramsey", "title": "Dispensed: Amazon and Best Buy's expanding healthcare ambitions, the history of controversial e-cig startup Juul, and the lowdown on Novartis' letter to the FDA", "description": "REUTERS/Joshua Roberts Hello, There must be something in the water that's sparked practically every retailer out there to this month reveal more about their healthcare strategies (Looking at you, Walmart + Sam's Club, Amazon, and Best Buy). See the rest of th…", "url": "https://www.businessinsider.com/dispensed-weekly-healthcare-newsletter-september-27-2019-9", "urlToImage": "https://image.businessinsider.com/5c2f7f05bd77305daf6487b5?width=1200&format=jpeg", "publishedAt": "2019-09-27T14:13:56Z", "content": "Hello,\r\nThere must be something in the water that's sparked practically every retailer out there to this month reveal more about their healthcare strategies (Looking at you, Walmart + Sam's Club, Amazon, and Best Buy). \r\nBetween that and the turmoil in the e-… [+4189 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Substance abuse affects about 15% of American employees, Path wants to ensure they get help", "description": "America has an addiction problem. It’s a problem that serial entrepreneur Josh Bruno has seen first hand. And it’s why he’s launched a new company called Path, which pitches access to specialized substance addiction treatment professionals as an employee heal…", "url": "http://techcrunch.com/2019/10/23/substance-abuse-affects-about-15-of-american-employees-path-wants-to-ensure-they-get-help/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-23-at-12.05.07-PM.png?w=748", "publishedAt": "2019-10-23T19:05:51Z", "content": "America has an addiction problem.\r\nIt’s a problem that serial entrepreneur Josh Bruno has seen first hand. And it’s why he’s launched a new company called Path, which pitches access to specialized substance addiction treatment professionals as an employee hea… [+4279 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Zachary Hendrickson), Zachary Hendrickson", "title": "Amazon's AI-powered Textract is now eligible for HIPAA compliance", "description": "This story was delivered to Business Insider Intelligence Digital Health Pro subscribers earlier this morning. To get this story plus others to your inbox each day, hours before they're published on Business Insider, click here. Amazon recently announced that…", "url": "https://www.businessinsider.com/amazon-textract-eligible-for-hipaa-compliance-2019-10", "urlToImage": "https://image.businessinsider.com/5c59d9b8598e2366a145fafd?width=1200&format=jpeg", "publishedAt": "2019-10-14T13:46:19Z", "content": "Amazon recently announced that Textract, it's AI-powered service capable of automatically extracting text and data from scanned documents, is now HIPAA-eligible, joining a growing list of AI healthcare tools from the e-commerce giant now available for use in … [+1657 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Zachary Hendrickson), Zachary Hendrickson", "title": "Microsoft is launching an ambient voice assistant project with Nuance", "description": "This story was delivered to Business Insider Intelligence Digital Health Pro subscribers earlier this morning. To get this story plus others to your inbox each day, hours before they're published on Business Insider, click here. Microsoft and Massachusetts-ba…", "url": "https://www.businessinsider.com/microsoft-nuance-develop-clinical-voice-assistant-2019-10", "urlToImage": "https://image.businessinsider.com/5d55bf4dcd978450f616290a?width=1200&format=jpeg", "publishedAt": "2019-10-18T14:13:26Z", "content": "Microsoft and Massachusetts-based conversational AI firm Nuance are working together to accelerate the delivery of ambient clinical intelligence (ACI) — a suite of tech solutions that gather information from patient-clinician conversations, which is input dir… [+3873 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "ebrodwin@businessinsider.com (Erin Brodwin), Erin Brodwin", "title": "BREAKING: Bankrupt poop-testing startup uBiome is shutting down", "description": "Hollis Johnson / Business Insider The Silicon Valley microbiome-testing startup uBiome filed for bankruptcy protection earlier this month after months of challenges and setbacks. Now, uBiome is shutting down. The startup is converting from chapter 11 to chapt…", "url": "https://www.businessinsider.com/ubiome-bankruptcy-ceases-operations-liquidates-chapter-7-2019-10", "urlToImage": "https://image.businessinsider.com/5cf68bef11e2053b7d214039?width=1200&format=jpeg", "publishedAt": "2019-10-02T00:28:00Z", "content": "After months of challenges and setbacks, the Silicon Valley health startup uBiome is shutting down. \r\nThe company could not extend the loans that had been funding its bankruptcy and is now appointing a trustee to oversee its liquidation, according to document… [+1359 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Business Insider Intelligence), Business Insider Intelligence", "title": "These are the top five trends shaping the future of digital health", "description": "BII The healthcare industry is in a state of disruption. Digital solutions are becoming a necessary part of the new global standard of care for patients and regulation is being fast-tracked to catch up to digital health innovation. These rapid changes will ha…", "url": "https://www.businessinsider.com/intelligence/top-5-trends-shaping-the-future-of-digital-health", "urlToImage": "https://media-bii-originals.businessinsider.com/5ad4a7d6146e7122008b4a64", "publishedAt": "2019-10-13T11:00:00Z", "content": null}, {"source": {"id": null, "name": "Entrepreneur.com"}, "author": "Toby Nwazor", "title": "A Doctor's Guide to Building a Business in the Digital World", "description": "What one physician learned about becoming a modern medical entrepreneur:", "url": "https://www.entrepreneur.com/article/340537", "urlToImage": "https://assets.entrepreneur.com/content/3x2/2000/20191016203037-GettyImages-697538657.jpeg", "publishedAt": "2019-10-17T19:00:00Z", "content": "October\r\n17, 2019\r\n5 min read\r\nOpinions expressed by Entrepreneur contributors are their own.\r\nIn today's digital age, both media and marketing play an important role in medical-practice growth. Patients are becoming more tech-savvy and more conscious of not … [+5339 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "'A rainbow wave': The rise of America's transgender politicians", "description": "\"I know what it's like to be marginalised\" - the first National Trans Visibility March is on Saturday.", "url": "https://www.bbc.co.uk/news/newsbeat-49336529", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/7505/production/_108975992_1925305a-b92e-4333-a45d-2874f0574d29.jpg", "publishedAt": "2019-09-27T05:14:59Z", "content": "Image copyrightGetty/Friends of Sarah McBride/Phillipe Cunningham\r\n\"It was election night 2016. I was at a joke 'end of the world' theme party - nobody thought Donald Trump would actually win. His victory sealed the deal and pushed me to run.\"\r\nBack then, Phi… [+7375 chars]"}, {"source": {"id": null, "name": "Yahoo.com"}, "author": null, "title": "Johnson & Johnson posts 23% rise in third-quarter profit - Yahoo Finance", "description": "Shares of the company, which makes products ranging from prescription drugs to consumer goods such as Band-Aids, rose 2% to $133.48 in premarket trading.  J&J shares have been under pressure this year, widely underperforming the S&P healthcare sector , as the…", "url": "https://finance.yahoo.com/news/johnson-johnson-posts-23-rise-105222209.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/wIHvqee7qvn6Bp8bRWl8dA--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/8c42d6e0473c46bc40627941046b07d9", "publishedAt": "2019-10-15T10:52:00Z", "content": "(Reuters) - Johnson &amp; Johnson &lt;JNJ.N&gt; boosted its profit forecast for the year on Tuesday after posting better-than-expected quarterly earnings on stronger prescription sales of its psoriasis treatment Stelara and cancer drug Imbruvica.\r\nShares of t… [+2108 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Rachel Thompson", "title": "Abortion and same-sex marriage are now legal in Northern Ireland", "description": "Northern Ireland's highly restrictive abortion ban lifted at midnight on Monday after legislation was brought in by MPs at Westminster. Same-sex marriage was also legalised under the change to the law. The historic law change marks the beginning of a new chap…", "url": "https://mashable.com/article/northern-ireland-abortion-same-sex-marriage/", "urlToImage": "https://mondrian.mashable.com/2019%252F10%252F21%252Ff6%252Ff08761be5c5142a78ef3ca7a4e5a3ef2.2e664.jpg%252F1200x630.jpg?signature=MjXx3stBOKX9iFM4JJVid7VaZ9g=", "publishedAt": "2019-10-21T23:01:00Z", "content": "Northern Ireland's highly restrictive abortion ban lifted at midnight on Monday after legislation was brought in by MPs at Westminster. Same-sex marriage was also legalised under the change to the law. \r\nThe historic law change marks the beginning of a new ch… [+5572 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "feedback@businessinsider.com (Mike Elk), Mike Elk", "title": "2020 Democratic candidates keep promising to help American workers. Here's how they can prove it.", "description": "Rebecca Cook/Reuters Democratic presidential candidates have promised to help American workers and have walked the picket lines with striking UAW workers. But during discussions about how to help workers during Tuesday's Democratic debate, the candidates fail…", "url": "https://www.businessinsider.com/2020-democrat-presidential-candidates-help-american-workers-jobs-2019-10", "urlToImage": "https://image.businessinsider.com/5da74cbccc4a0a7e6d5525a9?width=1200&format=jpeg", "publishedAt": "2019-10-16T22:59:37Z", "content": "When some of the media attention on the month-long standoff between General Motors and the United Auto Workers petered out, one group of national figures helped keep some focus on tentatively concluded strike: the 2020 Democratic presidential candidates.\r\nMan… [+7884 chars]"}, {"source": {"id": "the-next-web", "name": "The Next Web"}, "author": "Ravie Lakshmanan", "title": "Cybercriminals are targeting healthcare companies with phishing campaigns to steal sensitive data", "description": "Healthcare providers are facing an unprecedented level of social engineering-driven malware threats, according to new research. The findings — disclosed by California-based enterprise security solutions provider Proofpoint US — discovered at least 77 percent …", "url": "https://thenextweb.com/?p=1248092", "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F07%2Fhealthcare-data-hed.png&signature=0a8b49e26b1551fbd37eedd111d313d6", "publishedAt": "2019-10-09T16:00:49Z", "content": "Healthcare providers are facing an unprecedented level of social engineering-driven malware threats, according to new research.\r\nThe findings disclosed by California-based enterprise security solutions provider Proofpoint US discovered at least 77 percent of … [+4890 chars]"}]}