{"status": "ok", "totalResults": 13103, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David Brooks", "title": "How to Beat Trump on Immigration", "description": "A generous vision of a multicultural world.", "url": "https://www.nytimes.com/2019/11/07/opinion/trump-immigration.html", "urlToImage": "https://static01.nyt.com/images/2019/11/07/opinion/07brooks3/07brooks3-facebookJumbo.jpg", "publishedAt": "2019-11-07T22:40:29Z", "content": "The crucial question becomes: Do the people in the encounter feel secure enough to learn from it rather than to react with anxiety and fear? Right now, we are asking millions of Americans to accept high immigration while they are already living with maximum i… [+1833 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tracey Tully", "title": "In Blue New Jersey, a Conservative Backlash on Immigration", "description": "Though the state is heavily Democratic, there are Republican strongholds where voters support local cooperation with federal immigration agents.", "url": "https://www.nytimes.com/2019/11/08/nyregion/nj-immigration-ice.html", "urlToImage": "https://static01.nyt.com/images/2019/11/08/nyregion/08njimmigration1-print/08njimmigration1-facebookJumbo.jpg", "publishedAt": "2019-11-08T12:55:00Z", "content": "Immigration will likely be one issue Republicans will push next year as they seek to reclaim House seats in Republican-leaning New Jersey districts where Democrats won last year. \r\nThe states Democratic attorney general, Gurbir S. Grewal, first issued the Imm… [+1286 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Walter Thompson", "title": "Immigrants from China and India can accelerate the green card process", "description": "Securing a green card can feel overwhelming for people in Silicon Valley who were born in India and China. But with the right help and guidance from a skilled immigration attorney, the process can be simpler, smoother and more successful.", "url": "http://techcrunch.com/2019/11/06/immigrants-from-china-and-india-can-accelerate-the-green-card-process/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-1085801142.jpg?w=514", "publishedAt": "2019-11-06T16:16:13Z", "content": "More posts by this contributor\r\nSecuring a green card can feel overwhelming for people in Silicon Valley who were born in India and China. But with the right help and guidance from a skilled immigration attorney, the process can be simpler, smoother and more … [+2765 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Immigration chief fires back at lawmaker calling him racist at hearing", "description": "Acting director of US Citizenship and Immigration Services, Ken Cuccinelli, and  Rep. Debbie Wasserman Schultz (D-FL) got in a heated back and forth during a congressional hearing over immigration policy.", "url": "https://www.cnn.com/videos/politics/2019/10/30/cuccinelli-debbie-wasserman-schultz-white-supremacy-hearing-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191030170139-cuccinelli-super-tease.jpg", "publishedAt": "2019-10-30T22:16:34Z", "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Artemis Moshtaghian and Christina Maxouris, CNN", "title": "Worker injured when hotel collapsed was detained by ICE two days later", "description": "A worker who fell down three stories after the Hard Rock Hotel under construction in New Orleans partially collapsed was detained by immigration officials two days later, his spokesperson and immigration authorities say.", "url": "https://www.cnn.com/2019/10/20/us/hard-rock-hotel-worker-ice-detention/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190920163236-ice-officer-file-super-tease.jpg", "publishedAt": "2019-10-20T05:11:23Z", "content": null}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sara Aridi", "title": "A Dreamer Finds Her Voice", "description": "For years, Prioska Galicia feared discussing her immigration status. Now protected under DACA, she wants to share the experiences of undocumented immigrants as a journalist.", "url": "https://www.nytimes.com/2019/11/06/neediest-cases/DACA-recipient-dreamer-new-york.html", "urlToImage": "https://static01.nyt.com/images/2019/11/04/neediest-cases/00ncf-galicia/00ncf-galicia-facebookJumbo.jpg", "publishedAt": "2019-11-06T15:32:50Z", "content": "With her status came a newfound courage to openly discuss her past. In late 2016, Little Sisters connected her with New York magazine, which featured her in an article about immigrant New Yorkers living in a sanctuary city. That was the first time I spoke to … [+1707 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-Youngs", "title": "White House Finds Loophole in Search for Homeland Security Secretary", "description": "Officials who lead agencies in the department and echo the president’s language on immigration were initially thought to be ineligible under a federal law.", "url": "https://www.nytimes.com/2019/10/29/us/politics/white-house-homeland-security.html", "urlToImage": "https://static01.nyt.com/images/2019/10/29/us/politics/29dc-dhs2/29dc-dhs2-facebookJumbo.jpg", "publishedAt": "2019-10-30T02:49:38Z", "content": "The White House, however, is exploring a loophole in the law, according to an administration official. Under this route, the White House would tap someone to be the assistant secretary of the Countering Weapons of Mass Destruction Office, which is vacant, and… [+826 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Geneva Sands, Carma Hassan, Chuck Johnston, Miguel Marquez, Linh Tran and Ivana Kottasová, CNN", "title": "British family 'traumatized' after being detained by US immigration", "description": "A British family has filed a complaint with the the Department of Homeland Security over their detention by US immigration officials after crossing the US border while vacationing in British Columbia, Canada earlier this month, the family's lawyers said on Tu…", "url": "https://www.cnn.com/2019/10/15/world/british-family-detained-us-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190920163236-ice-officer-file-super-tease.jpg", "publishedAt": "2019-10-16T00:44:58Z", "content": "(CNN)A British family has filed a complaint with the the Department of Homeland Security over their detention by US immigration officials after crossing the US border while vacationing in British Columbia, Canada earlier this month, the family's lawyers said … [+3575 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Christina Goldbaum", "title": "A Taco Truck in Buffalo Served Lunch to ICE Workers. Then Came the Backlash.", "description": "A request to park a food truck outside a federal detention center thrust a small company into the national debate over immigration.", "url": "https://www.nytimes.com/2019/10/28/nyregion/lloyd-taco-truck-controversy.html", "urlToImage": "https://static01.nyt.com/images/2019/10/28/nyregion/28tacotruck/28tacotruck-facebookJumbo.jpg", "publishedAt": "2019-10-28T22:23:14Z", "content": "The company first apologized on Thursday for a lapse in judgment in sending a truck to the detention center on the previous day and then promised to evaluate all future locations and events to ensure they aligned with its values. Lloyd also pledged to donate … [+1233 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Megan Rose Dickey", "title": "GitHub faces more resignations in light of ICE contract", "description": "Microsoft-owned GitHub has been under intense scrutiny as of late for its $200,000 contract with Immigration and Customs Enforcement. Now, another employee, engineer Alice Goldfuss, has resigned. In a tweet, Goldfuss said GitHub has a number of problems to ad…", "url": "http://techcrunch.com/2019/11/13/github-faces-more-resignations-in-light-of-ice-contract/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/08/IMG_20190506_125609.jpg?w=591", "publishedAt": "2019-11-13T16:40:48Z", "content": "Microsoft-owned GitHub has been under intense scrutiny as of late for its $200,000 contract with Immigration and Customs Enforcement. Now, another employee, engineer Alice Goldfuss, has resigned.\r\nIn a tweet, Goldfuss said GitHub has a number of problems to a… [+2454 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Tom McKay", "title": "U.S. Border Patrol Reportedly Eyes Face Recognition for Body Cams", "description": "U.S. Customs and Border Protection—one of the arms of the federal immigration machine shoving tens of thousands of people into de facto concentration camps —is eyeing equipping officers with facial recognition body cams, according to Reuters. Read more...", "url": "https://gizmodo.com/u-s-border-patrol-reportedly-eyes-face-recognition-for-1839168813", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/wqvhgql8jtp2nzcnitux.jpg", "publishedAt": "2019-10-18T18:10:00Z", "content": "U.S. Customs and Border Protectionone of the arms of the federal immigration machine shoving tens of thousands of people into de facto concentration campsis eyeing equipping officers with facial recognition body cams, according to Reuters.\r\nReuters wrote that… [+2838 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Walter Thompson", "title": "Work permit delays disrupt foreign workers’ career plans", "description": "Immigration advocates are rightly fretting over the Trump administration’s new health insurance mandate and efforts to dismantle the asylum system. But away from the spotlight, another crisis is quietly brewing that could affect virtually every foreign-born S…", "url": "http://techcrunch.com/2019/10/30/work-permit-delays-disrupt-foreign-workers-career-plans/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-187591458.jpg?w=600", "publishedAt": "2019-10-30T19:33:40Z", "content": "More posts by this contributor\r\nImmigration advocates are rightly fretting over the Trump administrationsnew health insurance mandate and efforts to dismantle the asylum system. But away from the spotlight, another crisis is quietly brewing that could affect … [+4016 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-Youngs and Miriam Jordan", "title": "New Trump Administration Proposal Would Charge Asylum Seekers an Application Fee", "description": "The proposal also includes increasing fees for those applying for citizenship by more than 60 percent.", "url": "https://www.nytimes.com/2019/11/08/us/politics/immigration-fees-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/11/08/us/08dc-immig/merlin_160958094_a70dce11-ec26-45fc-8f98-29a67dd48495-facebookJumbo.jpg", "publishedAt": "2019-11-09T03:34:32Z", "content": "United States Citizenship and Immigration Services, he said in a statement, is required to examine incoming and outgoing expenditures, just like a business, and make adjustments based on that analysis. He said the proposed changes would help an overextended s… [+1430 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Adam Liptak", "title": "Is It a Crime to Encourage Unauthorized Immigration? The Supreme Court Will Decide", "description": "An appeals court struck down a broad 1986 law under the First Amendment, saying it covers conversations between family members and legal advice.", "url": "https://www.nytimes.com/2019/11/11/us/politics/supreme-court-immigration-speech.html", "urlToImage": "https://static01.nyt.com/images/2019/11/11/us/politics/11dc-bar/11dc-bar-facebookJumbo.jpg", "publishedAt": "2019-11-11T12:25:14Z", "content": "In urging the Supreme Court to hear its appeal, the Trump administration said the Ninth Circuit had gone too far. The Supreme Court has said that striking down laws because they are too broad is strong medicine to be used only when the laws are unconstitution… [+1435 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Giovanni Russonello", "title": "The Supreme Court May Let Trump End DACA. Here’s What the Public Thinks About It.", "description": "Polls show the program to protect young undocumented immigrants from deportation is broadly popular. Democratic organizers see an opportunity to mobilize voters if it is ended.", "url": "https://www.nytimes.com/2019/11/15/us/politics/daca-supreme-court-polls.html", "urlToImage": "https://static01.nyt.com/images/2019/11/15/us/politics/15pollwatch/15pollwatch-facebookJumbo-v2.jpg", "publishedAt": "2019-11-15T21:57:09Z", "content": "Daniel Herrera, a communications consultant at the left-leaning Raben Group, said that if DACA ends, it could propel a youth mobilization campaign similar to the one that led to the programs passage in the first place. \r\nWhere DACA does come into play is: How… [+1650 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Rachel Lau", "title": "CAQ loses parliamentary motion on student immigration program reform - CTV News", "description": "CAQ loses parliamentary motion on student immigration program reform CTV News Quebec government won't back down on immigration reform | Watch News Videos Online Globalnews.ca Legault dismisses critics of immigration reforms, citing Facebook support Montreal G…", "url": "https://montreal.ctvnews.ca/caq-loses-parliamentary-motion-on-student-immigration-program-reform-1.4674076", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.4290181.1549758546!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2019-11-07T13:11:00Z", "content": "MONTREAL The Coalition Avenir Quebec (CAQ) lost a vote on a motion presented by the opposition Wednesday evening to cancel the governments reform to a fast-track immigration policy for graduates.\r\nOnly three of the partys members were present at the National … [+3063 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Jennings Brown", "title": "DOJ Rule Gives Green Light to Collect DNA from Asylum-Seekers and Detained Migrants", "description": "The Department of Justice released an amended regulation on Monday that allows the Trump administration to lay the groundwork for a sweeping new policy requiring DNA collection for nearly all migrants who are held temporarily or for an extended period of time…", "url": "https://gizmodo.com/doj-rule-gives-green-light-to-collect-dna-from-asylum-s-1839226354", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/kau10ukuy8aavxscc960.jpg", "publishedAt": "2019-10-21T15:40:00Z", "content": "The Department of Justice released an amended regulation on Monday that allows the Trump administration to lay the groundwork for a sweeping new policy requiring DNA collection for nearly all migrants who are held temporarily or for an extended period of time… [+3115 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aimee Ortiz", "title": "Judge Blocks Trump’s Plan to Bar Immigrants Who Can’t Pay for Health Care", "description": "The court ruling is the latest to derail administration initiatives to limit the admission of certain legal immigrants into the United States.", "url": "https://www.nytimes.com/2019/11/02/us/trump-immigration-health-care-visas.html", "urlToImage": "https://static01.nyt.com/images/2019/11/02/multimedia/02xp-immigrants/02xp-immigrants-facebookJumbo.jpg", "publishedAt": "2019-11-02T23:17:36Z", "content": "The president had justified the policy on the grounds that immigrants were more likely to be uninsured, and that costs associated with this care are passed on to the American people in the form of higher taxes, higher premiums, and higher fees for medical ser… [+778 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN", "title": "Stephen Miller privately promoted stories from white nationalist and fringe media organizations", "description": "Stephen Miller, the controversial senior White House policy adviser who holds hardline views on immigration, promoted stories from white nationalist and fringe media organizations to staffers of the far-right website Breitbart, a trove of leaked 2015 emails p…", "url": "https://www.cnn.com/2019/11/12/politics/stephen-miller-leaked-emails/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190425004422-file-stephen-miller-01-super-tease.jpg", "publishedAt": "2019-11-13T01:27:19Z", "content": "New York (CNN)Stephen Miller, the controversial senior White House policy adviser who holds hardline views on immigration, promoted stories from white nationalist and fringe media organizations to staffers of the far-right website Breitbart, a trove of leaked… [+4472 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Natasha Pinon", "title": "The U.S. held over 69,000 migrant children in government custody in 2019", "description": "Government data reveals that in 2019, the U.S. held a record 69,550 migrant children in government custody, according to reporting from the Associated Press. That number is up 42 percent from 2018's fiscal year. United Nations researchers say this means the U…", "url": "https://mashable.com/article/migrant-children-government-custody/", "urlToImage": "https://mondrian.mashable.com/2019%252F11%252F12%252F32%252F795f6e4dbf7a46018cb26a177a330019.27055.jpg%252F1200x630.jpg?signature=9Yc8LXxWFlMpWBBegzaerHY2W30=", "publishedAt": "2019-11-12T19:06:42Z", "content": "Government data reveals that in 2019, the U.S. held a record 69,550 migrant children in government custody, according to reporting from the Associated Press.\r\nThat number is up 42 percent from 2018's fiscal year. United Nations researchers say this means the … [+1115 chars]"}]}