{"status": "ok", "totalResults": 22088, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "Jon Fingas", "title": "Uber has to pay New Jersey nearly $650 million in employment taxes", "description": "Uber may insist that its drivers are contractors and not employees, but New Jersey isn't buying that argument. The state's labor department has slapped Uber and its Rasier subsidiary with a nearly $650 million bill for overdue unemployment and disability insu…", "url": "https://www.engadget.com/2019/11/14/new-jersey-uber-employment-tax-bill/", "urlToImage": "https://o.aolcdn.com/images/dims?thumbnail=1200%2C630&quality=80&image_uri=https%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fresize%3D2000%252C2000%252Cshrink%26image_uri%3Dhttps%253A%252F%252Fs.yimg.com%252Fos%252Fcreatr-uploaded-images%252F2019-11%252Fddcd8f60-0717-11ea-bdce-df4df48b8d5a%26client%3Da1acac3e1b3290917d92%26signature%3Da30fa76199587cc230c1d94b657c23c125f3f880&client=amp-blogside-v2&signature=f8d3464f99b94dce5ab5edbe9f172643348dc280", "publishedAt": "2019-11-14T19:43:00Z", "content": "New Jersey gave Uber a $54 million bill back in 2015, but it's not certain if the company ever paid that.\r\nNot surprisingly, Uber is contesting the bill. It told Engadget it was \"challenging this preliminary but incorrect determination,\" insisting that driver… [+732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Edward J. McCaffery", "title": "Opinion: Here's why Trump moved to Florida", "description": "Donald Trump's new address may indeed be about taxes, as he himself suggests, but just not about paying taxes (which he doesn't do).  Instead, the move seems inspired by attempts to disclose Trump's taxes, which the President also very much does not like to d…", "url": "https://www.cnn.com/2019/11/01/opinions/trump-move-to-florida-taxes-mccaffery/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191101144750-trump-florida-super-tease.jpg", "publishedAt": "2019-11-01T19:47:20Z", "content": "Edward J. McCaffery is Robert C. Packard trustee chair in law and a professor of law, economics and political science at the University of Southern California. He is the author of \"Fair Not Flat: How to Make the Tax System Better and Simpler\" and founder of t… [+2970 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Nicole Dieker on Two Cents, shared by Nicole Dieker to Lifehacker", "title": "See How the Democratic Candidates' Tax Plans Would Affect You", "description": "If you’re wondering how the top Democratic candidates’ tax plans differ from each other—and how those plans might change how much you pay in taxes—there’s a new online tool to help you visualize what each candidate is proposing. Read more...", "url": "https://twocents.lifehacker.com/see-how-the-democratic-candidates-tax-plans-would-affec-1839098593", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/jngkojai2z2lqnr0ur89.jpg", "publishedAt": "2019-10-16T16:30:00Z", "content": "If youre wondering how the top Democratic candidates tax plans differ from each otherand how those plans might change how much you pay in taxestheres a new online tool to help you visualize what each candidate is proposing.\r\nTax Justice Now is an interactive … [+1612 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jeremy W. Peters", "title": "Republicans, Defiant After Debate, Throw Punches on Impeachment and Economy", "description": "President Trump and his allies seized on debate moments over taxes, health care and economic inequality to portray the Democratic candidates as tax-and-spend liberals.", "url": "https://www.nytimes.com/2019/10/16/us/politics/republicans-democratic-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/10/16/us/politics/16repubs-debate/16repubs-debate-facebookJumbo.jpg", "publishedAt": "2019-10-16T17:44:07Z", "content": "Republicans also hope that the more that Democrats talk about impeachment, the more opening they will have to cast it as illegitimate. \r\nIts not lost on people that many of these candidates were actually on the record supporting impeachment before anyone was … [+2243 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Thomas Kaplan", "title": "Elizabeth Warren Says She Will Release a Plan to Finance ‘Medicare for All’", "description": "Ms. Warren had been criticized for sidestepping questions about whether she would raise taxes on the middle class to help finance her “Medicare for all” plan.", "url": "https://www.nytimes.com/2019/10/20/us/politics/elizabeth-warren-medicare-for-all.html", "urlToImage": "https://static01.nyt.com/images/2019/10/20/us/politics/20warren/merlin_162937098_c5103491-1526-4ee9-ae19-1004164e58d5-facebookJumbo.jpg", "publishedAt": "2019-10-20T20:04:34Z", "content": "On the subject of health care, Ms. Warren has aligned herself with one of her top rivals for the Democratic presidential nomination, Senator Bernie Sanders of Vermont, saying on the debate stage in June, Im with Bernie on Medicare for all. But Mr. Sanders has… [+1027 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "James Barron", "title": "Can Trump Avoid Taxes by Moving to Florida? It’s Not So Simple.", "description": "New York has a platoon of auditors who zealously examine whether people are trying to skirt taxes by improperly claiming that they live elsewhere.", "url": "https://www.nytimes.com/2019/11/01/nyregion/trump-florida-move-taxes.html", "urlToImage": "https://static01.nyt.com/images/2019/11/01/nyregion/01nyflorida001/01nyflorida001-facebookJumbo.jpg", "publishedAt": "2019-11-01T16:26:28Z", "content": "If New York does challenge a residency, the chances that a taxpayer will win are not good, Mr. Nittal said. \r\nThe reason is, New York is pulling data from cellphone carriers and other sources like social media sites, he said. When the state comes in and says,… [+930 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "The Billionaires Are Getting Nervous", "description": "Bill Gates and others warn that higher taxes would lead to lower growth. They have their facts backward.", "url": "https://www.nytimes.com/2019/11/08/opinion/bill-gates-warren-tax.html", "urlToImage": "https://static01.nyt.com/images/2019/11/08/opinion/08bilionsWeb/08bilionsWeb-facebookJumbo.jpg", "publishedAt": "2019-11-08T11:00:10Z", "content": "Congress has slashed taxation three times in the past four decades, each time for the stated purpose of spurring innovation and investment and growth. Each time, the purported benefits failed to materialize. President Trump initiated the most recent experimen… [+1569 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Henry Aaron", "title": "Rich Kids Can Spare Some of Their Inheritance", "description": "A tax on inherited money or property — unlike wealth or estate taxes — would be hard for even the fanciest accountants to shake.", "url": "https://www.nytimes.com/2019/10/15/opinion/rich-kids-can-spare-some-of-their-inheritance.html", "urlToImage": "https://static01.nyt.com/images/2019/10/15/opinion/15Aaron/15Aaron-facebookJumbo.jpg", "publishedAt": "2019-10-15T19:43:50Z", "content": "Fortunately, there is an alternative: an inheritance tax. This is how it would work: Cumulative inheritances (over a lifetime exempt amount), plus gifts (over an annual exempt amount), would be taxed. The rate would be the heirs personal income tax rate plus … [+2435 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Lisa Rowan on Two Cents, shared by Lisa Rowan to Lifehacker", "title": "What Would Medicare for All Cost You?", "description": "Democratic candidates for president want to overhaul health care. But who will pay for it? That was the question during last night’s fourth primary debate, which featured 12 candidates on one stage vying for attention. But the discussion around health care ma…", "url": "https://twocents.lifehacker.com/what-would-medicare-for-all-cost-you-1839098294", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/hov1mia77iw4pgf8bsff.jpg", "publishedAt": "2019-10-16T17:45:00Z", "content": "Democratic candidates for president want to overhaul health care. But who will pay for it? That was the question during last nights fourth primary debate, which featured 12 candidates on one stage vying for attention. But the discussion around health care may… [+3536 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Bryan Menegus", "title": "Even New Jersey Is Handing Uber Its Own Ass", "description": "New Jersey, my beloved home state and perpetual butt of regional jokes, scored a major win for drivers—one that could also cost the slumping rideshare company as much as $650 million in fines and unpaid taxes. Read more...", "url": "https://gizmodo.com/even-new-jersey-is-handing-uber-its-own-ass-1839860097", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/h6fl6dviisvk2s4ujogd.jpg", "publishedAt": "2019-11-14T17:10:00Z", "content": "New Jersey, my beloved home state and perpetual butt of regional jokes, scored a major win for driversone that could also cost the slumping rideshare company as much as $650 million in fines and unpaid taxes.\r\nConsiderable attention has been paid to Ubers con… [+2176 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Emily Price", "title": "These Are the 2020 Tax Brackets", "description": "The IRS released the federal tax rates and income brackets for 2020 today. The seven tax rates themselves remain the same as they were in 2019; however, the income limits for each have been adjusted to account for inflation over the course of the year. Read m…", "url": "https://lifehacker.com/these-are-the-2020-tax-brackets-1839669655", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/xshvnirs9irxrqnbwkdo.jpg", "publishedAt": "2019-11-06T19:45:00Z", "content": "The IRS released the federal tax rates and income brackets for 2020 today. The seven tax rates themselves remain the same as they were in 2019; however, the income limits for each have been adjusted to account for inflation over the course of the year.\r\nThese… [+1607 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Astor", "title": "Where Michael Bloomberg Stands on the Issues", "description": "Mr. Bloomberg has been an outspoken voice on gun control and climate change, but his views on taxes would put him on the conservative end of the Democratic field.", "url": "https://www.nytimes.com/2019/11/08/us/politics/michael-bloomberg-issues.html", "urlToImage": "https://static01.nyt.com/images/2019/11/08/us/politics/08bloomberg-issues/merlin_164019729_5ad18f82-8afe-42fa-8657-ec86ca94e71c-facebookJumbo.jpg", "publishedAt": "2019-11-08T23:36:15Z", "content": "On taxes, health care and other economic issues, Mr. Bloomberg would be very much on the conservative end of the Democratic field. \r\nHe argued in January that a tax on the wealth of rich Americans would be unconstitutional because the Constitution lets you im… [+973 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Thomas Kaplan, Abby Goodnough and Margot Sanger-Katz", "title": "Elizabeth Warren Releases Plan to Pay for ‘Medicare for All’", "description": "Ms. Warren would impose huge tax increases on businesses and billionaires to provide free health coverage for all Americans, but she says she would not raise taxes on the middle class.", "url": "https://www.nytimes.com/2019/11/01/us/politics/elizabeth-warren-medicare-for-all.html", "urlToImage": "https://static01.nyt.com/images/2019/11/01/us/politics/01warren-medicare/01warren-medicare-facebookJumbo.jpg", "publishedAt": "2019-11-01T12:45:34Z", "content": "But in responding to her rivals and more tightly embracing Medicare for all, Ms. Warren is taking a significant political risk. Although she is not proposing broad tax increases on individuals, her proposal will still allow Republicans to portray her as a tax… [+3028 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Giovanni Russonello", "title": "Are Democrats Willing to Pay More in Taxes for Medicare for All?", "description": "Elizabeth Warren has declined to acknowledge that middle-class taxes would need to go up to pay for a single-payer health care system. How would Democratic voters feel if she did?", "url": "https://www.nytimes.com/2019/10/18/us/politics/latest-democratic-polls.html", "urlToImage": "https://static01.nyt.com/images/2019/10/18/us/politics/18pollwatch-01/18pollwatch-01-facebookJumbo.jpg", "publishedAt": "2019-10-18T14:42:32Z", "content": "A tax hike for the wealthy is broadly popular especially among Democrats, but also with independents.\r\nVoters across the board actually support higher taxes on the wealthy and on corporations, John Hudak, a senior fellow at the Brookings Institution, said in … [+1614 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Benjamin Weiser", "title": "Trump Taxes: Appeals Court Rules President Must Turn Over 8 Years of Tax Returns", "description": "A three-judge appeals panel said the president’s accounting firm had to comply with a subpoena.", "url": "https://www.nytimes.com/2019/11/04/nyregion/trump-taxes-vance-appeal.html", "urlToImage": "https://static01.nyt.com/images/2019/10/29/nyregion/00nytrump1/00nytrump1-facebookJumbo.jpg", "publishedAt": "2019-11-04T15:47:41Z", "content": null}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Benjamin Weiser and Azi Paybarah", "title": "Trump Taxes: Judges Seem Skeptical of Bid to Block Subpoena for Returns", "description": "President Trump is appealing a ruling ordering him to abide by a subpoena from state prosecutors to turn over eight years of tax returns.", "url": "https://www.nytimes.com/2019/10/23/nyregion/trump-taxes-vance.html", "urlToImage": "https://static01.nyt.com/images/2019/10/17/nyregion/17nytrump/17nytrump-facebookJumbo.jpg", "publishedAt": "2019-10-23T15:05:34Z", "content": "The appeal by Mr. Trumps lawyers came after a lower court judge ruled on Oct. 7 that the presidents argument that he could not be investigated by a local prosecutor was repugnant to the nations governmental structure and constitutional values.\r\nMr. Vances off… [+1430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Zandi for CNN Business Perspectives", "title": "Opinion: Warren's Medicare for All plan won't raise taxes on middle class, economist says", "description": "It's no secret that I'm not a fan of Medicare for All. That's why I'm impressed that Senator Elizabeth Warren's campaign reached out to me to independently review her proposed financing plan for the program. Her numbers add up and her plan fully finances the …", "url": "https://www.cnn.com/2019/11/13/perspectives/elizabeth-warren-medicare-for-all-taxes-middle-class/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/191112165235-elizabeth-warren-1101-restricted-super-tease.jpg", "publishedAt": "2019-11-13T18:38:53Z", "content": "Mark Zandi is chief economist of Moody's Analytics. He was an advisor to John McCain's 2008 presidential campaign and supported Hillary Clinton in the 2016 presidential election. The opinions expressed in this commentary are his own. \r\nIt's no secret that I'm… [+5336 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Matt Novak", "title": "Bill Gates Doesn't Rule Out Voting For Trump If Democrats Make Him Pay Too Much in Taxes", "description": "Bill Gates, a man who’s worth an estimated $107 billion, suggested on Wednesday he’d be open to voting for President Donald Trump in 2020 if the Democrats try to make him pay his fair share in taxes. The bizarre suggestion is just the latest sign that America…", "url": "https://gizmodo.com/bill-gates-doesnt-rule-out-voting-for-trump-if-democrat-1839686670", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/cqc7tmdi0zofdimewztd.jpg", "publishedAt": "2019-11-07T12:00:00Z", "content": "Bill Gates, a man whos worth an estimated $107 billion, suggested on Wednesday hed be open to voting for President Donald Trump in 2020 if the Democrats try to make him pay his fair share in taxes. The bizarre suggestion is just the latest sign that American … [+3705 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Rachel Kraus", "title": "A proposed tax on WhatsApp calls leads to massive protests in Lebanon", "description": "After word got around in Lebanon that the government was planning to tax WhatsApp calls, thousands of people demonstrated in the streets of Beirut. The plan was to impose a 20-cent fee for a person's first call of the day. As Fortune reports, the Lebanese gov…", "url": "https://mashable.com/article/whatsapp-tax-lebanon-protests/", "urlToImage": "https://mondrian.mashable.com/2019%252F10%252F18%252F2f%252F48e193abd4914e389e46dd16f3feebf7.cf72b.jpg%252F1200x630.jpg?signature=OfrN5v2MfyXIMS_Sx6P1NIpvwM4=", "publishedAt": "2019-10-18T17:40:12Z", "content": "After word got around in Lebanon that the government was planning to tax WhatsApp calls, thousands of people demonstrated in the streets of Beirut. \r\nThe plan was to impose a 20-cent fee for a person's first call of the day. \r\nAs Fortune reports, the Lebanese… [+973 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Lebanon's Bassil urges reforms, no new taxes amid protests", "description": "Lebanon's Foreign Minister Gebran Bassil said on Friday that the government must not impose any new taxes, work to stop corruption and enact long-delayed reforms but warned that mass protests may lead to strife.", "url": "https://www.reuters.com/article/us-lebanon-economy-protests-bassil-idUSKBN1WX1SP", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191018&t=2&i=1442320007&w=1200&r=LYNXMPEF9H1GZ", "publishedAt": "2019-10-18T14:13:25Z", "content": "BEIRUT (Reuters) - Lebanon’s Foreign Minister Gebran Bassil said on Friday that the government must not impose any new taxes, work to stop corruption and enact long-delayed reforms but warned that mass protests may lead to strife. \r\nAddressing calls from prot… [+164 chars]"}]}